[
  {
    "id": 1,
    "question_en": "What is the difference between Static Site Generation (SSG) and Server-Side Rendering (SSR)?",
    "question_ar": "ما الفرق بين توليد الصفحات الثابتة (SSG) وعرض الصفحات من جهة الخادم (SSR)؟",
    "answer_en": "SSG generates HTML at build time, making pages very fast and cacheable. SSR generates HTML on each request, providing fresh data but with slower response compared to SSG.",
    "answer_ar": "SSG يقوم بإنشاء الصفحات وقت البناء مما يجعلها سريعة وقابلة للتخزين المؤقت. SSR يقوم بإنشاء الصفحات عند كل طلب مما يوفر بيانات حديثة لكنه أبطأ نسبيًا."
  },
  {
    "id": 2,
    "question_en": "What is the difference between Server-Side Rendering (SSR) and Client-Side Rendering (CSR)?",
    "question_ar": "ما الفرق بين عرض الصفحات من جهة الخادم (SSR) وعرض الصفحات من جهة العميل (CSR)؟",
    "answer_en": "SSR renders content on the server before sending it to the browser. CSR loads JavaScript in the browser and renders content on the client side.",
    "answer_ar": "SSR يعرض المحتوى على الخادم قبل إرساله للمتصفح. CSR يعتمد على تحميل JavaScript في المتصفح ثم عرض المحتوى من جهة العميل."
  },
  {
    "id": 3,
    "question_en": "What is an API?",
    "question_ar": "ما هو الـ API؟",
    "answer_en": "API (Application Programming Interface) is a set of rules that allows applications to communicate and exchange data.",
    "answer_ar": "الـ API هو واجهة برمجة التطبيقات، مجموعة من القواعد التي تسمح للتطبيقات بالتواصل وتبادل البيانات."
  },
  {
    "id": 4,
    "question_en": "What is REST API?",
    "question_ar": "ما هو REST API؟",
    "answer_en": "REST API is an architectural style that uses HTTP methods (GET, POST, PUT, DELETE) to interact with resources identified by URLs.",
    "answer_ar": "REST API هو أسلوب معماري يعتمد على طرق HTTP (GET, POST, PUT, DELETE) للتعامل مع الموارد عبر الروابط."
  },
  {
    "id": 5,
    "question_en": "What is GraphQL and how is it different from REST?",
    "question_ar": "ما هو GraphQL وما الفرق بينه وبين REST؟",
    "answer_en": "GraphQL lets clients request exactly the data they need in a single query. REST provides fixed endpoints with predefined data structures.",
    "answer_ar": "GraphQL يسمح للعميل بطلب البيانات التي يحتاجها فقط في استعلام واحد. بينما REST يقدم روابط ثابتة مع هياكل بيانات محددة مسبقًا."
  },
  {
    "id": 6,
    "question_en": "What is SEO and why is it important?",
    "question_ar": "ما هو SEO ولماذا هو مهم؟",
    "answer_en": "SEO (Search Engine Optimization) improves a website’s visibility in search engines, increasing traffic and potential users.",
    "answer_ar": "SEO هو تحسين محركات البحث لزيادة ظهور الموقع في نتائج البحث، مما يزيد من عدد الزوار والمستخدمين المحتملين."
  },
  {
    "id": 7,
    "question_en": "What is the difference between HTTP and HTTPS?",
    "question_ar": "ما الفرق بين HTTP و HTTPS؟",
    "answer_en": "HTTPS is the secure version of HTTP. It uses SSL/TLS encryption to protect data between client and server.",
    "answer_ar": "HTTPS هو النسخة الآمنة من HTTP حيث يستخدم بروتوكول SSL/TLS لتشفير البيانات بين العميل والخادم."
  },
  {
    "id": 8,
    "question_en": "What is a CDN and why is it used?",
    "question_ar": "ما هو CDN ولماذا يُستخدم؟",
    "answer_en": "A CDN (Content Delivery Network) is a network of servers distributed globally to deliver content faster and reduce latency.",
    "answer_ar": "CDN شبكة خوادم موزعة عالميًا لتقديم المحتوى بسرعة أكبر وتقليل زمن التأخير."
  },
  {
    "id": 9,
    "question_en": "What is caching in web development?",
    "question_ar": "ما هو التخزين المؤقت (Caching) في تطوير الويب؟",
    "answer_en": "Caching stores copies of files or data temporarily to reduce load times and server requests.",
    "answer_ar": "التخزين المؤقت يعني حفظ نسخ من الملفات أو البيانات بشكل مؤقت لتقليل زمن التحميل وتقليل عدد الطلبات على الخادم."
  },
  {
    "id": 10,
    "question_en": "What is a Progressive Web App (PWA)?",
    "question_ar": "ما هو التطبيق التقدمي (PWA)؟",
    "answer_en": "A PWA is a web app that offers native app-like experiences, including offline access and push notifications.",
    "answer_ar": "PWA هو تطبيق ويب يقدم تجربة مشابهة للتطبيقات الأصلية، مثل العمل دون اتصال وإرسال الإشعارات."
  },
  {
    "id": 11,
    "question_en": "What are cookies?",
    "question_ar": "ما هي الـ Cookies؟",
    "answer_en": "Cookies are small pieces of data stored in the browser to track user sessions and preferences.",
    "answer_ar": "الكوكيز هي ملفات بيانات صغيرة تُخزن في المتصفح لتتبع جلسات المستخدم وتفضيلاته."
  },
  {
    "id": 12,
    "question_en": "What is the difference between cookies, localStorage, and sessionStorage?",
    "question_ar": "ما الفرق بين الـ Cookies و localStorage و sessionStorage؟",
    "answer_en": "Cookies are sent with every HTTP request. localStorage stores data permanently in the browser. sessionStorage stores data temporarily for the session only.",
    "answer_ar": "الكوكيز تُرسل مع كل طلب HTTP. localStorage يخزن البيانات بشكل دائم في المتصفح. sessionStorage يخزن البيانات مؤقتًا لجلسة التصفح فقط."
  },
  {
    "id": 13,
    "question_en": "What is responsive design?",
    "question_ar": "ما هو التصميم المتجاوب؟",
    "answer_en": "Responsive design makes web pages adapt to different screen sizes and devices.",
    "answer_ar": "التصميم المتجاوب يعني أن صفحات الويب تتكيف مع أحجام الشاشات والأجهزة المختلفة."
  },
  {
    "id": 14,
    "question_en": "What is lazy loading?",
    "question_ar": "ما هو التحميل الكسول (Lazy Loading)؟",
    "answer_en": "Lazy loading delays loading of non-critical resources (like images) until they are needed.",
    "answer_ar": "التحميل الكسول يؤخر تحميل الموارد غير الضرورية (مثل الصور) حتى وقت الحاجة إليها."
  },
  {
    "id": 15,
    "question_en": "What is cross-origin resource sharing (CORS)?",
    "question_ar": "ما هو CORS؟",
    "answer_en": "CORS is a security feature that controls how resources can be requested from a different domain than the one serving the page.",
    "answer_ar": "CORS هي ميزة أمان تتحكم في كيفية السماح للموارد بأن تُطلب من دومين مختلف عن الدومين الذي يخدم الصفحة."
  },
  {
    "id": 16,
    "question_en": "What is a web server?",
    "question_ar": "ما هو خادم الويب؟",
    "answer_en": "A web server is software or hardware that serves web content (HTML, images, etc.) to users over the internet.",
    "answer_ar": "خادم الويب هو برنامج أو جهاز يقدم محتوى الويب (مثل HTML والصور) للمستخدمين عبر الإنترنت."
  },
  {
    "id": 17,
    "question_en": "What is the difference between frontend and backend?",
    "question_ar": "ما الفرق بين الـ Frontend والـ Backend؟",
    "answer_en": "Frontend is what the user sees and interacts with. Backend handles the logic, database, and server operations.",
    "answer_ar": "الـ Frontend هو ما يراه ويتفاعل معه المستخدم. الـ Backend مسؤول عن المنطق والبيانات وعمليات الخادم."
  },
  {
    "id": 18,
    "question_en": "What is the DOM in web development?",
    "question_ar": "ما هو الـ DOM في تطوير الويب؟",
    "answer_en": "The DOM (Document Object Model) is a programming interface that represents the structure of a web page as a tree.",
    "answer_ar": "DOM هو واجهة برمجية تمثل هيكل صفحة الويب كشجرة من العناصر."
  },
  {
    "id": 19,
    "question_en": "What is the difference between GET and POST requests?",
    "question_ar": "ما الفرق بين طلبات GET و POST؟",
    "answer_en": "GET requests data from the server and is visible in the URL. POST sends data to the server, usually in the request body, and is more secure for sensitive data.",
    "answer_ar": "GET تستخدم لجلب البيانات من الخادم وتظهر في الرابط. POST ترسل البيانات إلى الخادم في جسم الطلب وتعتبر أكثر أمانًا للبيانات الحساسة."
  },
  {
    "id": 20,
    "question_en": "What is version control and why is it important?",
    "question_ar": "ما هو نظام التحكم في الإصدارات ولماذا هو مهم؟",
    "answer_en": "Version control systems (like Git) track code changes, allow collaboration, and help manage project history.",
    "answer_ar": "أنظمة التحكم في الإصدارات (مثل Git) تتعقب تغييرات الكود، تسهل التعاون، وتساعد في إدارة تاريخ المشروع."
  }
]
